using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace formss
{
    public partial class AnnualTestingEquipmentForm : Form
    {
        public AnnualTestingEquipmentForm()
        {
            InitializeComponent();
        }

        private void AnnualTestingEquipmentForm_Load(object sender, EventArgs e)
        {
                // تنظیم متن به راست به چپ
    richTextBox1.RightToLeft = RightToLeft.Yes;
  

    // قفل کردن RichTextBox برای جلوگیری از ویرایش
    richTextBox1.ReadOnly = true;

    // تنظیم فونت برای نمایش صحیح متن فارسی
    richTextBox1.Font = new Font("Tahoma", 12);

    // قرار دادن متن مورد نظر
    richTextBox1.Text = @" آزمون صحت زمان سنج :
 
 تجهیزات و لوازم موردنیاز: 
برای انجام این آزمون زمان سنج دیجیتالی و یا دستگاه تحلیلگر غیرتهاجمی پرتوایکس مورد نیاز است. 
 

 آزمون تکرار پذیری زمان :


تجهیزات موردنیاز: 
برای انجام این آزمون دستگاه تحلیلگر و غیرتهاجمی پرتوایکس مورد نیاز است. 


آزمون صحت ولتاژ :

تجهیزات و لوازم موردنیاز: 
برای انجام این آزمون دستگاه تحلیلگر غیرتهاجمی پرتوایکس مورد نیاز است.


آزمون تکرار پذیری ولتاژ :

تجهیزات و لوازم موردنیاز: 
برای انجام این آزمون دستگاه تحلیلگر غیرتهاجمی پرتوایکس مورد نیاز است. 


آزمون شاخص دز سی تی اسکن در فانتوم :

تجهیزات و لوازم موردنیاز: 
1- فانتوم¬های سر و بدن آکریلیک به ترتیب با قطرهای 561  و 921 میلیمتر بوده و دارای سوراخ¬هایی در کناره¬ها و مرکز برای قرار دادن پروب دزیمتر است. 
2- پروب قلمی دزیمتری جهت اندازه¬گیری دز پرتو سی تی اسکن. 
3- دستگاه آزمونگر غیرتهاجمی تحلیلگر پرتوایکس. 


 آزمون تغییرات CTDI در هوا نسبت به ضخامت اسلاید: 

تجهیزات و لوازم موردنیاز: 
1- دزیمتر با پروب قلمی جهت اندازه¬گیری دز پرتو سی تی اسکن. 
2-  دستگاه تحلیلگر غیرتهاجمی پرتوایکس. 
3- گیره و پایه نگهدارنده پروب. 


آزمون تغییرات CTDI در هوا نسبت به kVp: 

 تجهیزات و لوازم موردنیاز: 
1- پروب قلمی دزیمتری جهت اندازه¬گیری دز پرتو سی تی اسکن  
2- دستگاه تحلیلگر غیرتهاجمی پرتوایکس 
3- گیره و پایه نگهدارنده پروب 


 آزمون تغییرات CTDI در هوا نسبت بهmA: 

تجهیزات و لوازم موردنیاز: 
1- پروب قلمی دزیمتری جهت اندازه¬گیری دز پرتو سی تی اسکن  
2- دستگاه تحلیلگر غیرتهاجمی پرتوایکس 
3- گیره و پایه نگهدارنده پروب 


 آزمون تغییرات CTDI در هوا نسبت به زمان: 

تجهیزات و لوازم موردنیاز: 
1- پروب قلمی دزیمتری جهت اندازه¬گیری دز پرتو سی تی اسکن  
2- دستگاه تحلیلگر غیرتهاجمی پرتوایکس  
3- گیره و پایه نگهدارنده پروب 


 آزمون پهنای مقطع تصویر شده

 تجهیزات و لوازم موردنیاز: 
فانتوم مخصوص این آزمون که دارای یک تیغه فلزی، مفتول و یا یک ردیف حفره است که با زاویه معین نسبت به صفحه اسلاید در درون فانتوم جای گذاری شده است. 


 آزمون بازده هندسی

 تجهیزات و لوازم موردنیاز: 
1-  تعدادی فیلم خام که درون پاکت مخصوص خود قرار دارند. 
2-  دستگاه دانسیتومتر.
3-  خطکش. 


 آزمون اندازه گیری کیفیت پرتو(HVL)

 تجهیزات و لوازم موردنیاز: 
1- دستگاه تحلیلگر غیرتهاجمی پرتوایکس 
2-  فیلترهای آلومینیومی از نوع 1100 با خلوص بالای %99 و باضخامت¬های مختلف از 1/. میلی¬متر تا 10 میلی¬متر
3-  نوارچسب 
 
4- پایه و گیره جهت نگهداری آشکارساز دستگاه تحلیلگر  


آزمون نشت لامپ

 تجهیزات و لوازم موردنیاز: 
1- دستگاه تحلیلگر غیرتهاجمی پرتوایکس 
2-  صفحه سربی بزرگ به ضخامت 3/0 میلی¬متر برای پوشاندن کولیماتور اولیه لامپ مولد پرتو 
3-  تعدادی فیلم خام در پاکت مخصوص آن 
4-  نوارچسب  
1-  نشانگرهای غیر شفاف نسبت به پرتوایکس 


  آزمون یکنواختی عدد سی تی در هاردکپی

 تجهیزات و لوازم موردنیاز: 
1-  دستگاه دانسیتومتر 
2-  فیلم 
 Plastic Stepwedge  -3


آزمون خطی بودن عدد سی تی

 تجهیزات و لوازم موردنیاز: 
فانتوم مخصوص سی تی اسکن که دارای چند نوع ماده مختلف (حداقل چهار نوع) با عدد سی تی اسکن بینHU  1000- تا 1000 HU + باشد


آزمون اعوجاج تصویر در هارد کپی


 تجهیزات موردنیاز: 
1-  فیلم (و یا هارد کپی مورداستفاده در بیمارستان نظیر پرینتر)
2-  خط کش دقیق و استاندارد (نظیر کولیس)
3-  فانتوم سی تی اسکن که دارای یک الگوی مناسب با فواصل معین باشد. 


آزمون صحت Gantry Tilt 

تجهیزات و لوازم موردنیاز: 
1-  کاست بارگذاری شده (حاوی فیلم) 
2-  پایه نگهدارنده برای کاست. 
3-  نقاله. 


 آزمون صحت ابزار اندازه گیری فاصله در تصویر: 

تجهیزات و لوازم موردنیاز: 
فانتوم سی تی اسکن (که حاوی نشانگرهایی با فواصل معین باشد) 


آزمون صحت سامانه مکان یابی: 

 تجهیزات و لوازم موردنیاز: 
1-  فانتوم سی تی اسکن 
2-  چسب نواری 
 ";
        }
    }
}
