using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace formss
{
    public partial class AnnualTestGuideForm : Form
    {
        public AnnualTestGuideForm()
        {
            InitializeComponent();
        }

        private void richTextBox1_TextChanged(object sender, EventArgs e)
        {

        }

        private void AnnualTestGuideForm_Load(object sender, EventArgs e)
        {
            // تنظیم متن به راست به چپ
            richTextBox1.RightToLeft = RightToLeft.Yes;
          

            // قفل کردن RichTextBox برای جلوگیری از ویرایش
            richTextBox1.ReadOnly = true;


            // متن مورد نظر را اینجا وارد کنید
            richTextBox1.Text = @"
آزمون صحت زمان سنج: 
            این آزمون جهت تعیین میزان صحت زمان سنج مربوط به زمان پرتودهی دستگاه سی تی اسکن انجام می‌شود تا اطمینان حاصل شود زمان واقعی پرتودهی به بیمار که توسط دستگاه انجام شده است با زمانی که توسط کاربر بر روی دستگاه تنظیم شده است، یکسان است. 

            آزمون تکرارپذیری زمان: 
            پیش از انجام این آزمون، باید صحت و تکرارپذیری ولتاژ، صحت زمان پرتودهی و تکرارپذیری در خروجی پرتو دستگاه مورد ارزیابی و تأیید قرارگرفته باشند. هدف از انجام این آزمون اطمینان از تکرارپذیری عملکرد قسمت مربوط به کنترل زمان پرتودهی دستگاه سی تی اسکن است به‌نحویکه در حالت‌های یکسان و شرایط تنظیمی ثابت، حتی‌الامکان پاسخ دستگاه یکسان و مشابه یکدیگر باشد. 

            آزمون صحت ولتاژ: 
            این آزمون جهت حصول اطمینان از صحت ولتاژ لامپ مولد پرتوایکس دستگاه سی تی اسکن است به‌نحویکه ولتاژ kVp تنظیم شده بر روی دستگاه در محدوده قابل قبول، همان ولتاژی است که توسط قسمت ژنراتور ولتاژ دستگاه تولیدشده است. 

            آزمون تکرارپذیری ولتاژ: 
            هدف از انجام این آزمون اطمینان از تکرارپذیری عملکرد قسمت مربوط به ولتاژ لامپ مولد پرتوایکس دستگاه سی تی اسکن است. به‌طوریکه در حالت‌های یکسان و شرایط تنظیمی ثابت، پاسخ دستگاه حتی‌الامکان یکسان و مشابه باشد.

            آزمون شاخص دز سیتی اسکن در فانتوم: 
            هدف از انجام این آزمون اندازه‌گیری شاخص دز سی تی اسکن دستگاه سی تی اسکن در یک فانتوم سی تی اسکن آکریلیک استاندارد سر و بدن به ترتیب دارای قطرهای 561 و 921 میلیمتر است.

            آزمون تغییرات CTDI در هوا نسبت به ضخامت اسلاید: 
            هدف از انجام این آزمون بررسی میزان تغییرات دز در واحد طول پرتو سی تی اسکن، نسبت به تغییر ضخامت مقطع برش تنظیم شده اسلایس بر روی دستگاه سی تی اسکن است.

            آزمون تغییرات CTDI در هوا نسبت به kVp: 
            هدف از انجام این آزمون بررسی میزان تغییرات دز پرتو سی تی اسکن، نسبت به تغییر ولتاژ لامپ مولد پرتوایکس kVp دستگاه است.

            آزمون تغییرات CTDI در هوا نسبت به mA: 
            هدف از انجام این آزمون بررسی میزان تغییرات دز پرتو سی تی اسکن نسبت به تغییر جریان mA لامپ مولد پرتوایکس تنظیم شده بر روی دستگاه سی تی اسکن است.

            آزمون تغییرات CTDI در هوا نسبت به زمان: 
            هدف از انجام این آزمون بررسی میزان تغییرات دز پرتو سی تی اسکن نسبت به تغییر زمان پرتودهی تنظیم شده بر روی دستگاه سی تی اسکن است.

            آزمون پهنای مقطع تصویر شده: 
            هدف از انجام این آزمون مقایسه و حصول اطمینان از مطابقت ضخامت اسلاید تنظیم شده موردبررسی بر روی دستگاه سی تی اسکن با ضخامت اسلاید حاصل شده از مقطع بدن در دستگاه سی تی اسکن است.

            آزمون بازده هندسی: 
            هدف از انجام این آزمون بررسی و حصول اطمینان از یکسان بودن ضخامت اسلاید تنظیمی بر روی دستگاه با ضخامت پرتو تابیده شده به بیمار است.

            آزمون اندازه‌گیری کیفیت پرتو (HVL): 
            هدف از انجام آزمون، تشخیص کیفیت پرتوایکس و حصول اطمینان از اینکه فیلتر به کار گرفته شده در قسمت لامپ مولد پرتوایکس دستگاه سی تی اسکن، مقدار دز دریافتی از طریق پوست بیمار را به کمترین میزان مناسب کاهش می‌دهد. بررسی پرتوایکس دستگاه سی تی اسکن از طریق تعیین ضخامت ماده‌ای است که بتواند شدت پرتوایکس را به نصف مقدار آن در قبل از عبور از ماده کاهش دهد. به‌طوریکه اطمینان حاصل شود دز پرتو دریافت شده توسط پوست بیمار به کمترین میزان ممکن کاهش یافته و در عین حال با حذف و فیلتر نمودن پرتوهای ضعیف، کیفیت تصویر افزایش یافته است.

            آزمون نشت لامپ: 
            هدف از انجام این آزمون بررسی و شناسایی هرگونه سطح و یا منفذ موجود بر روی محفظه لامپ مولد پرتوایکس و کولیماتور اولیه دستگاه سی تی اسکن است که موجب نشت پرتوایکس به محیط خارج گردد و نیز تعیین میزان این نشتی است.

            یکنواختی عدد سی تی در هارد کپی: 
            هدف از انجام این آزمون حصول اطمینان از صحت انتقال اطلاعات تصویر تهیه شده بر روی فیلم از طریق بررسی دانسیته اپتیکی نواحی مختلف تصویر است.  
خطی بودن عدد سی تی: 
            هدف از انجام این آزمون بررسی خطی بودن تغییرات عدد سی تی اسکن مربوط به تصویر تهیه شده از مواد مختلف نسبت به چگالی الکترونی مواد مذکور است، به‌طوریکه عدد سی تی اسکن مربوط به هر ماده شناخته شده که به عنوان مرجع در نظر گرفته می‌شود در کلیه دستگاه‌های سی تی اسکن یکسان و مشابه یکدیگر است.

            آزمون اعوجاج تصویر در هارد کپی: 
            هدف از این آزمون حصول اطمینان از تطابق تصویر مشاهده شده بر روی مانیتور دستگاه و عدم ایجاد اعوجاج آن در انتقال بر روی فیلم و یا هارد کپی دیگر نظیر پرینتر است.

            آزمون صحت Gantry Tilt: 
            هدف از انجام این آزمون بررسی میان صحت زاویه قسمت گانتری دستگاه سی تی اسکن نسبت به تخت دستگاه است.

آزمون صحت ابزار اندازه گیری فاصله در تصویر: 
هدف از انجام این آزمون بررسی صحت ابزار اندازه¬گیری فاصله بر روی تصویر دستگاه سی تی اسکن است به-طوریکه اطمینان حاصل شود فواصل اندازه¬گیری شده بر روی تصویر (در مانیتور دستگاه) به کمک نرم افزار دستگاه، با فواصل واقعی عناصر تحت آزمون مطابقت دارد.

 آزمون صحت سامانه مکان یابی: 
هدف از انجام این آزمون حصول اطمینان از صحت سامانه مکان¬یابی نوری دستگاه و تطابق آن با پرتوایکس و تصویر اسلاید انتخاب شده است.
 ";
      
        }
    }
}
