using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace formss
{
    public partial class AnnualTestCriteriaForm : Form
    {
        public AnnualTestCriteriaForm()
        {
            InitializeComponent();
        }

        private void AnnualTestCriteriaForm_Load(object sender, EventArgs e)
        {
                // تنظیم متن به راست به چپ
    richTextBox1.RightToLeft = RightToLeft.Yes;
    

    // قفل کردن RichTextBox برای جلوگیری از ویرایش
    richTextBox1.ReadOnly = true;

    // تنظیم فونت برای نمایش صحیح متن فارسی
    richTextBox1.Font = new Font("Tahoma", 12);

    // قرار دادن متن مورد نظر
    richTextBox1.Text = @"
  آزمونصحت زمان سنج : 

 معیار پذیرش:  
معیار پذیرش دستگاه سی تی اسکن در این آزمون، خطای کمتر یا مساوی %10 تا %20 باشد، دستگاه سی تی اسکن نیاز به اصلاح و رفع عیب دارد. 
معیار تعلیق: 
درصورتیکه خطای به دست آمده در هر مرحله از اندازه گیری¬ها نسبت به زمان تنظیمی بین %10 تا %20 باشد استفاده از دستگاه سی تی اسکن مجاز نخواهد بود و مرکز بهره برداری کننده باید نسبت به رفع اشکال دستگاه اقدام نماید. 


آزمون تکرار پذیری زمان : 

 معیار پذیرش: 
معیار پذیرش دستگاه سی تی اسکن در این آزمون، ضریب تغییرات زمان پرتودهی کمتر یا مساوی %5  است. 
معیار اصلاح: 
درصورتیکه ضریب تغییرات به¬دست آمده برای پرتودهی بین%5 تا %20 باشد دستگاه نیاز به اصلاح و رفع عیب دارد. 
معیار تعلیق: 
درصورتیکه ضریب تغییرات به¬دست آمده برای پرتودهی بیشتر از %20 باشد استفاده از دستگاه مجاز نخواهد بود و مرکز بهره برداری کننده باید نسبت به رفع عیب دستگاه اقدام نماید


 آزموتن صحت ولتاژ

 معیار پذیرش: 
درصورتیکه خطای به¬دست آمده برای ولتاژ kVp کمتر یا مساوی %10 مقدار تنظیمی آن باشد، دستگاه سی تی اسکن در این آزمون پذیرفته شده است. 
معیار اصلاح: 
اگر خطای به دست آمد برای ولتاژ kVp بین%10 تا  %20 مقدار تنظیمی آن باشد، دستگاه نیاز به اصلاح و رفع عیب دارد.
معیار تعلیق: 
درصورتیکه خطای به¬دست آمده برای ولتاژ kVp بیش از %20 مقدار تنظیمی باشد، استفاده از دستگاه سی تی اسکن مجاز نخواهد بود و مرکز بهره برداری کننده از آن باید نسبت به رفع عیب نقص دستگاه اقدام نماید. 


آزمون تکرار پذیری ولتاژ

 
معیار پذیرش: 
معیار پذیرش دستگاه سی تی اسکن در آزمون، ضریب تغییرات ولتاژ کمتر یا مساوی %5 است. 
معیار اصلاح: 
درصورتیکه ضریب تغییرات به¬دست آمده برای ولتاژ بین %5 تا %20 باشد، دستگاه سی تی اسکن نیاز به اصلاح و رفع عیب دارد. 
معیار تعلیق: 
درصورتیکه تغییرات به¬دست¬آمده بیشتر از %20 باشد، استفاده از دستگاه سی تی اسکن مجاز نخواهد بود و مرکز بهره برداری کننده باید نسبت به رفع مشکل و عیب دستگاه اقدام نماید.


  آزمون شاخص دز سی تی اسکن

   
معیار پذیرش: 
معیار پذیرش دستگاه سی تی اسکن در این آزمون، دز متوسط کمتر یا مساوی %20 نسبت به مقدار مشخص شده آن توسط شرکت سازنده برای شرایط مربوطه است. 
معیار اصلاح: 
درصورتیکه دز متوسط اندازه¬گیری شده%20 تا %50 نسبت به مقدار مشخص¬شده آن توسط کمپانی سازنده اختلاف داشته باشد، دستگاه سی تی اسکن نیاز به اصلاح و رفع عیب دارد. 
معیار تعلیق: 
درصورتیکه دز متوسط اندازه¬گیری شده بیش از %50 نسبت به مقدار مشخص¬شده آن توسط شرکت سازنده اختلاف داشته باشد، استفاده از دستگاه سی تی اسکن مجاز نخواهد بود و مرکز بهره¬برداری کننده از آن باید نسبت به رفع عیب دستگاه اقدام نماید. 


 آزمون تغییرات CTDI در هوا نسبت به ضخامت اسلاید: 

 معیار پذیرش: 
معیار پذیرش دستگاه سی تی اسکن در این آزمون،CTDI در واحد mGy کمتر از %20 نسبت به مقدار تعیین شده آن توسط شرکت سازنده است. 
معیار اصلاح: 
درصورتیکه CTDI اندازه¬گیری شده بین %20 تا %50 نسبت به مقدار تعیین شده آن توسط شرکت سازنده اختلاف داشته باشد، دستگاه سی تی اسکن نیاز به اصلاح و رفع عیب دارد. 
معیار تعلیق: 
درصورتیکه CTDI اندازه¬گیری شده بیش از %50 نسبت به مقدار تعیینشده آن توسط شرکت سازنده اختلاف داشته باشد، استفاده از دستگاه سی تی اسکن مجاز نخواهد بود و مرکز بهره¬برداری کننده از آن باید نسبت به رفع عیب دستگاه اقدام نماید.


 آزمون تغییرات CTDI در هوا نسبت به kVp: 

 معیار پذیرش: 
معیار پذیرش دستگاه سی تی اسکن در این آزمون CTDI در واحدmGy کمتر از %20 نسبت به مقدار تعیین شده توسط کارخانه سازنده است. 
معیار اصلاح: 
درصورتیکه CTDI اندازه¬گیری شده بین %20  تا 50% نسبت به مقدار تعیین¬شده آن توسط کارخانه سازنده اختلاف داشته باشد، دستگاه سی تی اسکن نیاز به اصلاح و رفع عیب از طریق شرکت خدمات دهنده مجاز دارد. 
معیار تعلیق:
درصورتیکه CTDI اندازه¬گیری شده بیش از %11 نسبت به مقدار تعیین¬شده آن توسط کارخانه سازنده اختلاف داشته باشد، استفاده از دستگاه سی تی اسکن مجاز نخواهد بود و مرکز بهره¬برداری کننده از آن میبایست از طریق شرکت مرتبط نسبت به رفع عیب دستگاه اقدام نماید.



 آزمون تغییرات CTDI در هوا نسبت بهmA: 

 معیار پذیرش: 
معیار پذیرش دستگاه سی تی اسکن در این آزمون CTDI کمتر یا مساوی %50 نسبت به مقدار تعیین شده آن توسط شرکت سازنده است. 
معیار اصلاح: 
درصورتیکه CTDI بهدستآمده در این آزمون بین %20 تا %50 نسبت به مقدار تعیین¬شده آن اختلاف داشته باشد ،دستگاه نیاز به اصلاح و رفع دارد. 
معیار تعلیق:
درصورتیکه CTDI به¬دست¬آمده در این آزمون بیش از %50 نسبت به مقدار تعیین شده آن توسط شرکت سازنده اختلاف داشته باشد، استفاده از دستگاه سی تی اسکن مجاز نخواهد بود و مرکز بهره برداری کننده از آن باید نسبت به رفع عیب دستگاه اقدام نماید.



 آزمون تغییرات CTDI در هوا نسبت به زمان: 

 معیار پذیرش: 
معیار پذیرش دستگاه سی تی اسکن در این آزمون، مقدار دز در واحد طول کمتر یا مساوی %50 نسبت به مقدار تعیین شده آن توسط شرکت سازنده است. 
معیار اصلاح: 
درصورتیکه مقدار دز در واحد طول به¬دست¬آمده در این آزمون بین %20 تا  %50 نسبت به مقدار تعیین شده آن توسط شرکت سازنده اختلاف داشته باشد، استفاده از دستگاه سی تی اسکن مجاز نخواهد بود و مرکز بهره برداری کننده از آن باید نسبت به رفع عیب دستگاه اقدام نماید


 آزمون پهنای مقطع تصویر شده

 معیار پذیرش: 
معیار پذیرش دستگاه سیتیاسکن در این آزمون، خطای کمتر یا مساوی %20 است.  
معیار اصلاح: 
درصورتیکه خطای به¬دست¬آمده برای ضخامت اسلاید بین %20 تا %30 باشد، دستگاه نیاز به اصلاح و رفع عیب دارد. 
معیار تعلیق: 
درصورتیکه خطای به¬دست¬آمده برای ضخامت اسلاید بیش از %30 باشد، استفاده از دستگاه مجاز نخواهد بود و مرکز بهره برداری کننده از آن باید نسبت به رفع عیب دستگاه اقدام نماید.


آزمون بازده هندسی  :


 معیار پذیرش: 
با توجه به تعریف بازده هندسی درصورتیکه خطای به¬دست¬آمده برای ضخامت اسلاید کمتر یا مساوی %20 باشد دستگاه سی تی اسکن در این آزمون پذیرفته شده است. 
معیار اصلاح: 
درصورتیکه بازده هندسی دارای خطای بین %20 تا %30 باشد، دستگاه سی تی اسکن نیاز به اصلاح و رفع عیب دارد. 
معیار تعلیق: 
درصورتیکه خطای به¬دست¬آمده برای بازده هندسی بیش از %30 باشد استفاده از دستگاه مجاز نخواهد بود و مرکز بهره برداری کننده از آن باید نسبت به رفع عیب دستگاه اقدام نماید.


آزمون اندازه گیری کیفیت پرتو(HVL): 
 

 معیار پذیرش: 
معیار پذیرش دستگاه سیتیاسکن در این آزمون آن است که مقدار بهدستآمده برای ضخامت فیلتر  آلومینیومی HVL کمتر یا مساوی %20 نسبت به مقدار  HVL تعیین شده توسط شرکت سازنده دستگاه اختلاف داشته باشد ولی مطلقاً از مقادیر جدول 2-51 کمتر نباشد. 
معیار اصلاح: 
درصورتیکه مقدار HVL به¬دست¬آمده بین %20 تا %50 با مقدار تعیینشده آن توسط شرکت سازنده و یا مقدار اندازهگیری شده آن در زمان انجام آزمون¬های پذیرش اختلاف داشته و یا از مقادیر داده شده در جدول فوق کمتر باشد، دستگاه نیاز به اصلاح و رفع عیب دارد. 
معیار تعلیق: 
درصورتیکه مقدار HVL به¬دست¬آمده بیش از %11 با مقدار اندازه¬گیری شده آن در زمان انجام آزمون پذیرش و یا مقدار تعیین شده آن توسط شرکت سازنده اختلاف داشته و یا از مقادیر دادهشده در جدول 2-51 کمتر باشد، استفاده از دستگاه مجاز نخواهد بود و مرکز بهره¬برداری کننده از آن باید نسبت به رفع عیب دستگاه اقدام نماید.
 


آزمون نشت لامپ:

 معیار پذیرش: 
معیار پذیرش دستگاه در این آزمون، آهنگ دز پرتو نشتی کمتر از mGy/h 1 است. 
معیار اصلاح: 
درصورتیکه آهنگ دز پرتو نشتی بین mGy/h  5 تا mGy/h 1 باشد ،دستگاه سی تی اسکن نیاز به اصلاح و رفع عیب دارد. 
معیار تعلیق: 
درصورتیکه آهنگ دز پرتو نشتی بیش از mGy/h 5 باشد، استفاده از دستگاه سی تی اسکن مجاز نخواهد بود و مرکز بهره برداری کننده از آن باید نسبت به رفع عیب دستگاه اقدام لازم را به عمل آورد.


یکنواختی عدد سی تی در هارد کپی: 
 

 معیار پذیرش: 
درصورتیکه اختلاف دانسیته اپتیکی  نواحی مختلف  نسبت به یک نقطه مرکزی تصویر کمتر یا مساوی 12OD /0 باشد دستگاه سی تی اسکن در این آزمون پذیرفته شده محسوب می¬گردد. 
معیار اصلاح: 
درصورتیکه اختلاف دانسیته اپتیکی بین OD 0/12 تا OD 0/2 باشد، دستگاه نیاز به اصلاح و رفع عیب دارد. 
معیار تعلیق: 
درصورتیکه اختلاف دانسیته اپتیکی بیش از OD 0/12 باشد، استفاده از دستگاه مجاز نخواهد بود و مرکز بهره برداری کننده از آن باید نسبت به رفع عیب دستگاه اقدام لازم را به عمل آورد.


خطی بودن عدد سی تی : 


 معیار پذیرش: 
معیار پذیرش دستگاه سی تی اسکن در این آزمون ضریب خطی بیش از %95 است. 
معیار اصلاح: 
درصورتیکه ضریب خطی محاسبه شده بین %90 تا %95 باشد، دستگاه نیاز به اصلاح و رفع عیب دارد. 
معیار تعلیق: 
درصورتیکه ضریب خطی محاسبه شده کمتر از %90 باشد، استفاده از دستگاه مجاز نخواهد بود و مرکز بهره-برداری کننده از آن باید نسبت به رفع عیب دستگاه اقدام لازم را به عمل آورد.


آزمون اعوجاج تصویر درهارد کپی: 


 معیار پذیرش: 
درصورتی¬که میزان خطای اندازه¬گیری شده برای فواصل نقاط مشاهده شده بر روی فیلم یا پرینت نسبت به فواصل مشابه به آنها بر روی تصویر مانیتور کمتر یا مساوی  %10 باشد، دستگاه موردپذیرش است. معیار اصلاح: 
درصورتیکه میزان خطای اندازهگیری شده برای فواصل بیشتر از %10 باشد، دستگاه نیاز به اصلاح و رفع عیب دارد. 
معیار تعلیق: 
درصورتیکه میزان خطای اندازه¬گیری شده برای فواصل بیشتر از %20 باشد، استفاده از دستگاه سی تی اسکن مجاز نخواهد بود و مرکز بهره¬برداری کننده از آن باید نسبت به رفع عیب دستگاه اقدام لازم را به عمل آورد.


آزمون صحت Gantry Tilt 
  

معیار پذیرش: 
معیار پذیرش دستگاه در این آزمون خطای کمتر یا مساوی 3/0 درجه است. 
معیار اصلاح:  
درصورتی¬که خطای به¬دست¬آمده برای زاویه گانتری بین 3/0 تا 5/0 درجه باشد، دستگاه نیاز به اصلاح و رفع عیب دارد. 
معیار تعلیق: 
درصورتیکه خطای به¬دست¬آمده برای زاویه گانتری بیش از 5/0 درجه باشد، استفاده از دستگاه سی تی اسکن مجاز نخواهد بود و مرکز بهره¬برداری کننده از آن باید نسبت به رفع عیب دستگاه اقدام لازم را به عمل آورد.


آزمون صحت ابزار اندازه گیری فاصله در تصویر: 
 

  معیار پذیرش: 
معیار پذیرش دستگاه سی تی اسکن در این آزمون خطای کمتر یا مساوی %10 برای فواصل اندازه¬گیری شده در تصویر است. 
معیار اصلاح: 
درصورتیکه خطای به¬دست¬آمده برای فواصل تصویر بیشتر از %10 باشد، دستگاه نیاز به اصلاح و رفع عیب دارد. 
معیار تعلیق: 
درصورتیکه خطای به¬دست¬آمده بیشتر از %20 باشد، استفاده از دستگاه مجاز نیست. 


آزمون صحت سامانه مکان یابی: 


معیار پذیرش: 
معیار پذیرش دستگاه سی تی اسکن در این آزمون، انحراف تصویر نشانگرها کمتر یا مساوی 3/0 میلی¬متر است. 
معیار اصلاح: 
درصورتیکه میزان انحراف بین mm 0/3 تا mm 0/5 باشد دستگاه نیاز به اصلاح و رفع عیب دارد. 
معیار تعلیق: 
درصورتی¬که میزان انحراف بیش از mm 0/5 باشد استفاده از دستگاه مجاز نخواهد بود و مرکز بهره¬برداری کننده از آن باید نسبت به رفع عیب دستگاه اقدام لازم را به عمل آورد.
";
        }
    }
}
