using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace formss
{
    public partial class DeviceTypesForm : Form
    {
        public DeviceTypesForm()
        {
            InitializeComponent();
        }

        private void DeviceTypesForm_Load(object sender, EventArgs e)
        {

            // تنظیم متن به راست به چپ
            richTextBox1.RightToLeft = RightToLeft.Yes;
            
            // قفل کردن RichTextBox برای جلوگیری از ویرایش
            richTextBox1.ReadOnly = true;

            // تنظیم فونت برای نمایش صحیح متن فارسی
            Font font = new Font("Vazir", 9);
            richTextBox1.Font = font;

            // تنظیم حاشیه داخلی برای فاصله دادن متن از لبه‌ها
            richTextBox1.Padding = new Padding(10);

            // قرار دادن متن مورد نظر
            richTextBox1.Text = @"
             در ادامه برخی از انواع اصلی دستگاههای سی تی اسکن آورده شده است.
             
             1-3-1-	سی تی اسکن مارپیچی
             این نوع اسکنر از یک حرکت چرخشی مداوم در اطراف بیمار استفاده میکند که امکان تصویربرداری سریعتر و کارآمدتر را فراهم می کند. 
             این موضوع کمک می کند تا زمان مورد نیاز برای اسکن را در حین ارائه تصاویر دقیق به حداقل برسانید.



             1-3-2-	سی تی ردیاب چندگانه  (MDCT)
              اسکنرهای MDCT دارای ردیفهای متعددی از آشکارسازها هستند که چندین برش از بدن را به طور همزمان ضبط میکنند که 
            منجر به اسکن سریعتر و افزایش وضوح میشود. MDCT در کاربردهای مختلف تشخیصی و درمانی از جمله تصویربرداری قلب و 
             تشخیص تومور استفاده میشود


             1-3-3-	سی تی پرتو الکترونی
             این نوع اسکنر از پرتو الکترونی برای اسکن بدن استفاده میکند که امکان تصویربرداری بسیار سریع را فراهم میکند،
             به ویژه برای مطالعات قلبی مفید است


             1-3-4-	سی تی پرتو مخروطی
             اسکنرهای CBCT که عمدتاً در تصویربرداری دندانپزشکی و ارتوپدی مورد استفاده قرار میگیرند، از یک پرتو اشعه ایکس مخروطی 
             شکل برای تولید تصاویر سه بعدی استفاده میکنند که وضوح فضایی بالا و تجسم دقیق استخوان را ارائه میدهد


              1-3-5-	سی تی پرتابل
             این دستگاههای کوچکتر و قابل حمل، تصویربرداری کنار تخت را در بخشهای اورژانس، بخشهای مراقبتهای ویژه یا حتی در حین 
             عملیات نظامی امکان پذیر میکنند و در شرایط بحرانی تشخیص و درمان سریع را ارائه میدهند.

";

        }
    }
}
