using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace formss
{
    public partial class MonthlyTestCriteriaForm : Form
    {
        public MonthlyTestCriteriaForm()
        {
            InitializeComponent();
        }

        private void MonthlyTestCriteriaForm_Load(object sender, EventArgs e)
        {
                // تنظیم متن به راست به چپ
    richTextBox1.RightToLeft = RightToLeft.Yes;
   

    // قفل کردن RichTextBox برای جلوگیری از ویرایش
    richTextBox1.ReadOnly = true;

    // تنظیم فونت برای نمایش صحیح متن فارسی
    richTextBox1.Font = new Font("Vazir", 9);

    // قرار دادن متن مورد نظر
    richTextBox1.Text = @"  

  آزمون صحت عدد سی تی اسکن در موقعیت های مختلف: 

معیار پذیرش: 
معیار پذیرش دستگاه سی تی اسکن در این آزمون خطای کمتر یا مساوی 5HU برای عدد سی تی اسکن اندازه گیری شده است. 
معیار اصلاح: 
درصورتیکه بیشترین خطای عدد سی تی اسکن در وضعیت های مختلف بین 5HU تا 15HU  باشد، دستگاه نیاز به اصلاح و رفع عیب دارد. 
معیار تعلیق: 
درصورتیکه بیشترین خطای عدد سی تی اسکن بیش از 15HU  باشد، 
استفاده از دستگاه سی تی اسکن مجاز نخواهد بود و مرکز بهره برداری کننده از آن باید نسبت به رفع عیب دستگاه اقدام لازم را به عمل آورد.


آزمون صحت عدد سیتی اسکن در ضخامت های مختلف بیمار: 
  
 معیار پذیرش: 
درصورتیکه بیشترین خطای عدد سی تی اسکن برای هریک از فانتوم های کمتر یا مساوی 5HU  باشد دستگاه سی تی اسکن در این آزمون پذیرفته شده است. 
معیار اصلاح: 
درصورتیکه بیشترین خطای به دست آمده برای عدد سی تی اسکن و برای هر یک از فانتوم های بین 5HU تا 15HU باشد، دستگاه نیاز به اصلاح و رفع عیب دارد. 
معیار تعلیق: 
درصورتیکه بیشترین خطای عدد سی تی اسکن بیش از 15HU باشد، استفاده از دستگاه سی تی اسکن مجاز نخواهد بود و
مرکز بهره برداری کننده از آن باید نسبت به رفع عیب دستگاه اقدام لازم را به عمل آورد.


آزمون صحت عدد سی تی اسکن در الگوریتم¬های مختلف بازسازی تصویر: 

معیار پذیرش: 
معیار پذیرش دستگاه سی تی اسکن در این آزمون، خطای کمتر یا مساوی 5HU  برای عدد سی تی اسکن اندازهگیری شده است. 
معیار اصلاح: 
درصورتیکه بیشترین خطای عدد سی تی اسکن در الگوریتمهای مختلف بین 5HU 1 تا 15HU باشد، دستگاه نیاز به اصلاح و رفع عیب دارد. 
معیار تعلیق: 
درصورتیکه بیشترین خطای عدد سی تی اسکن بیش از 15HU باشد استفاده از دستگاه سی تی اسکن مجاز نخواهد بود و 
مرکز بهره برداری کننده از آن باید نسبت به رفع عیب دستگاه اقدام لازم را به عمل آورد.


آزمون صحت عدد سیتی اسکن در ضخامت¬های مختلف تصویر گیری: 

 معیار پذیرش: 
درصورتیکه بیشترین خطای عدد سی تی اسکن برای تصویر فانتوم آب و در هر یک از ضخامت اسلایس ها کمتر یا مساوی 5HU  باشد 
دستگاه سی تی اسکن در این آزمون پذیرفته شده است. 
معیار اصلاح: 
درصورتیکه بیشترین خطای به دست آمده برای عدد سی تی اسکن بین 5HU  تا 15HU  باشد، دستگاه نیاز به اصلاح و رفع عیب دارد. 
معیار تعلیق: 
درصورتیکه بیشترین خطای عدد سی تی اسکن بیش از 15HU باشد، استفاده از دستگاه سی تی اسکن مجاز نخواهد بود و
مرکز بهره برداری کننده از آن باید نسبت به رفع عیب دستگاه اقدام لازم را به عمل آورد.


آزمون یکنواختی عدد سی تی اسکن: 

معیار پذیرش: 
معیار پذیرش  دستگاه سی تی اسکن در این آزمون، اختلاف عدد سی تی اسکن هر یک از نواحی ROI با عدد سی تی اسکن مرکزی کمتر یا مساوی 5HU است. 
معیار اصلاح: 
درصورتیکه اختلاف به دست آمده بین 5HU تا 15HU باشد دستگاه سی تی اسکن نیاز به اصلاح و رفع عیب دارد. 
 
معیار تعلیق: 
درصورتیکه اختلاف به دست آمده برای عدد سی تی اسکن بیش از 15HU باشد استفاده از دستگاه سی تی اسکن مجاز نخواهد بود و
مرکز بهره برداری کننده از آن باید نسبت به رفع عیب دستگاه اقدام لازم را به عمل آورد.


  آزمون قدرت تفکیک فضایی در کنتراست بالا: 

 معیار پذیرش: 
معیار پذیرش دستگاه سی تی اسکن در این آزمون، اختلاف کمتر یا مساوی %20 مقدار قطر جزئی اندازه گیری شده در کنتراست بالا با مقدار مشخص شده 
آن توسط شرکت سازنده دستگاه است، به شرط آنکه این میزان مطلقاً بیشتر از 1mm قطر و یا کمتر از  2 نباشد. 
معیار اصلاح: 
درصورتیکه میزان اختلاف قطر جزئی اندازه گیری شده در کنتراست بالا بین %20 تا %50 با مقدار مشخص شده آن توسط شرکت سازنده دستگاه باشد،
(به شرط آنکه این میزان مطلقاً بیشتر از 1mm قطر و یا کمتر از 2 نباشد.) دستگاه نیاز به اصلاح و رفع عیب دارد. 
معیار تعلیق: 
درصورتیکه میزان اختلاف قطر جزئی اندازه گیری شده در کنتراست بالا بیش از %50  با مقدار مشخص شده آن توسط شرکت سازنده دستگاه باشد 
استفاده از دستگاه سی تی اسکن مجاز نخواهد بود و مرکز بهره برداری کننده از آن باید نسبت به رفع عیب دستگاه اقدام لازم را به عمل آورد.

 
آزمون قدرت تفکیک فضایی در کنتراست پایین: 

معیار پذیرش: 
معیار پذیرش دستگاه سی تی اسکن در این آزمون، اختلاف کمتر یا مساوی %20 مقدار قطر جزئی ناحیه دایره ای در کنتراست پایین با مقدار مشخص شده 
آن توسط شرکت سازنده است. به شرط آنکه این مقدار مطلقاً بیشتر از 5mm قطر در کنتراست %5/0 نباشد. 
معیار اصلاح: 
درصورتیکه میزان اختلاف قطر جزئی ناحیه دایرهای اندازه گیری شده در کنتراست پایین بین %20 تا %50 با مقدار مشخص شده
آن توسط شرکت سازنده دستگاه باشد ،(به شرط آنکه این میزان مطلقاً بیشتر از 5mm قطر در کنتراست %5/0 نباشد) دستگاه نیاز به اصلاح و رفع عیب دارد. 
معیار تعلیق: 
درصورتیکه میزان اختلاف قطر جزئی ناحیه دایره ای اندازه گیری شده در کنتراست پایین بیش از %50 با مقدار مشخص شده آن توسط شرکت سازنده 
دستگاه باشد (به شرط آنکه این میزان مطلقاً بیشتر از 5mm قطر در کنتراست %5/0 نباشد) 
استفاده از دستگاه سی تی اسکن مجاز نخواهد بود و مرکز بهره برداری کننده از آن باید نسبت به رفع عیب دستگاه اقدام لازم را به عمل آورد.


آزمون اعوجاج تصویر: 
 
 معیار پذیرش: 
درصورتی که میزان خطای اندازه گیری شده برای فواصل عناصر فانتوم نسبت به فواصل آن ها بر روی تصویر مانیتور کمتر یا مساوی %10 باشد،
دستگاه در این آزمون پذیرفته شده محسوب می گردد. 
معیار اصلاح: 
درصورتی که میزان خطای اندازه گیری شده برای فواصل بیشتر از %10 باشد، دستگاه نیاز به اصلاح و رفع عیب دارد. 
معیار تعلیق: 
درصورتی که میزان خطای اندازه گیری شده برای فواصل بیشتر از %20 باشد، استفاده از دستگاه سی تی اسکن مجاز نخواهد بود 
و مرکز بهره برداری کننده از آن باید نسبت به رفع عیب دستگاه اقدام لازم را به عمل آورد.


  آزمون تطابق نورهای سطح Sagital و Cronal: 

  معیار پذیرش: 
معیار پذیرش دستگاه در این آزمون اختلاف کمتر یا مساوی معیار پذیرش دستگاه در این آزمون اختلاف کمتر یا مساوی 2mm است. 
معیار اصلاح: 
درصورتی که اختلاف به دست آمده بیشتر از 2mm باشد دستگاه نیاز به اصلاح و رفع عیب دارد. 
معیار تعلیق: 
درصورتی که اختلاف به دست آمده بیشتر از 5mm باشد، استفاده از دستگاه سی تی اسکن مجاز نخواهد بود و
مرکز بهره برداری کننده از آن باید نسبت به رفع عیب دستگاه اقدام لازم را به عمل آورد.


آزمون تنظیم نقطه صفر تخت: 

معیار پذیرش: 
معیار پذیرش دستگاه در این آزمون، انحراف کمتر یا مساوی 2mm نسبت به نقطه صفر حرکت تخت است. 
معیار اصلاح: 
درصورتیکه میزان انحراف حرکت تخت نسبت به نقطه صفر آن بیش از 2mm  باشد، تخت دستگاه نیاز به اصلاح و رفع عیب دارد. 
معیار تعلیق: 
درصورتیکه میزان انحراف حرکت تخت نسبت به نقطه صفر آن بیش از 5mm باشد ،استفاده از دستگاه سی تی اسکن مجاز نخواهد بود 
و مرکز بهره برداری کننده از آن باید نسبت به رفع عیب دستگاه اقدام لازم را به عمل آورد.
 

آزمون صحت جابجایی تخت: 

 معیار پذیرش: 
معیار پذیرش دستگاه سی تی اسکن در این اختلاف کمتر یا مساوی %10 نسبت به مقادیر تنظیمی بر روی دستگاه است. 
معیار اصلاح: 
درصورتی که میزان اختلاف مقادیر مشاهده شده بر روی تصویر بیش از %10 نسبت به مقدار جابجایی تخت بین ضخامت اسلایس های تنظیم شده
بر روی دستگاه متفاوت باشد، دستگاه نیاز به اصلاح و رفع عیب دارد. 
معیار تعلیق: 
درصورتیکه میزان اختلاف مقادیر مشاهده شده بر روی تصویر بیش از %20 نسبت به مقدار جابجایی تخت بین ضخامت اسلایس های تنظیم شده بر روی 
دستگاه متفاوت باشد، استفاده از دستگاه سی تی اسکن مجاز نخواهد بود و مرکز بهره برداری کننده از آن بایدنسبت به رفع عیب دستگاه اقدام لازم را به عمل آورد.
 ";
        }
    }
}
