using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace formss
{
    public partial class MonthlyTestGuideForm : Form
    {
        public MonthlyTestGuideForm()
        {
            InitializeComponent();
        }

        private void MonthlyTestGuideForm_Load(object sender, EventArgs e)
        {
                // تنظیم متن به راست به چپ
    richTextBox1.RightToLeft = RightToLeft.Yes;
   

    // قفل کردن RichTextBox برای جلوگیری از ویرایش
    richTextBox1.ReadOnly = true;


    // قرار دادن متن مورد نظر
    richTextBox1.Text = @" آزمون صحت عدد سی تی اسکن در موقعیت¬های مختلف: 
هدف از انجام این آزمون حصول اطمینان از صحت اعداد سی تی اسکن تصویر تهیه شده از بیمار مستقل از موقعیت آن نسبت به دستگاه سی تی اسکن است. به¬نحوی¬که موقعیت عضو تحت آزمون بیمار نسبت به گانتری تأثیری در صحت عدد سی تی اسکن نداشته باشد. 

 آزمون صحت عدد سیتی اسکن در ضخامت های مختلف بیمار: 
هدف از انجام این آزمون حصول اطمینان از صحت عدد سی تی اسکن در تصویر تهیه شده از بیمار و مستقل از ابعاد عضو تحت آزمون است به نحویکه ابعاد بیمار تأثیری در صحت عدد سی تی اسکن نداشته باشد.
 آزمون صحت عدد سی تی اسکن در الگوریتم¬های مختلف بازسازی تصویر: 
هدف از انجام این آزمون حصول اطمینان از صحت عدد سی تی اسکن در تصویر تهیه شده از بیمار و مستقل از الگوریتم مورداستفاده برای بازسازی تصویر است به¬نحوی¬که الگوریتمهای مورداستفاده تأثیری در صحت عدد سی تی اسکن نداشته باشند.

آزمون صحت عدد سیتی اسکن در ضخامت¬های مختلف تصویر گیری: 
هدف از انجام این آزمون حصول اطمینان از صحت عدد سی تی اسکن در تصویر تهیه شده از بیمار و مستقل از ضخامت اسلاید انتخاب شده می¬باشند به نحوی که ضخامت های اسلاید متفاوت مورداستفاده، تأثیری در صحت عدد سی تی اسکن نداشته باشد 
آزمون یکنواختی عدد سی تی اسکن
: 
هدف از انجام این آزمون اندازه¬گیری میانگین عدد سی تی اسکن در فانتوم آب و بررسی یکنواختی آن در نواحی مختلف تصویر تهیه شده از فانتوم، توسط دستگاه سی تی اسکن است.

آزمون قدرت تفکیک فضایی در کنتراست بالا: 
هدف از انجام این آزمون ارزیابی قدرت تفکیک دستگاه سی تی اسکن در تصویر تهیه شده با کنتراست بالا است، به نحوی¬که کوچکترین عناصر موجود بر روی تصویر با توجه به معیارهای تعریف شده از یکدیگر قابل تشخیص باشند.

آزمون قدرت تفکیک فضایی در کنتراست پایین: 
هدف از انجام این آزمون ارزیابی قدرت تفکیک دستگاه سی تی اسکن در تصویر تهیه شده با کنتراست پایین است، به¬نحویکه عناصر و ساختارهای جزئی موجود در تصویر که ازنظر دانسیته اپتیکی اختلاف بسیار کمی با زمینه اطراف خوددارند قابل تشخیص و تمییز دادن باشند.
 
آزمون اعوجاج تصویر: 
هدف از انجام این آزمون حصول اطمینان از تطابق فواصل بین نقاط عضو تحت آزمون با فواصل آن نقاط در تصویر تهیه شده بر روی مانیتور دستگاه سی تی اسکن است. به¬طوریکه با در نظر گرفتن میزان بزرگنمایی تصویر بر روی مانیتور، این فواصل با یکدیگر مطابقت و مشابهت لازم را داشته باشند و تصویر معوج نباشد

آزمون تطابق نورهای داخلی و خارجی سطحAxial:   
هدف از انجام این آزمون بررسی تطابق نور داخلی و خارجی دستگاه نسبت به سطح اسکن  است.

آزمون انطباق نور داخلی سطحAxial با سطح Axial: 
هدف از انجام این آزمون بررسی تطابق نور داخلی با صفحه اسکن است.
 
 آزمون تطابق نورهای سطح Sagital و Cronal: 
هدف از انجام این آزمون بررسی میزان نورهای موازی و عمود بر سطح تخت (که به ترتیب در جهات Cronal و Sagital می¬باشند) دستگاه نسبت به مواضع بیمار است. 

 آزمون تنظیم نقطه صفر تخت: 
هدف از انجام آزمون بررسی صحت تخت سمت جلو و عقب و حصول اطمینان از تنظیم بودن نقطه صفر حرکت تخت و تکرارپذیری آن است.

آزمون صحت جابجایی تخت: 
هدف از انجام این آزمون بررسی صحت جابجایی و حرکت تخت دستگاه است به نحویکه ضخامت و فاصله انتخاب¬شده بین اسلایس های تنظیمی بر روی دستگاه با مقادیر واقعی آنها مطابقت داشته باشد.
 ";
        }
    }
}
