using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace formss
{
    public partial class StandrdsGuideForm : Form
    {
        public StandrdsGuideForm()
        {
            InitializeComponent();
        }

        private void StandrdsGuideForm_Load(object sender, EventArgs e)
        {

            // تنظیم متن به راست به چپ
            richTextBox1.RightToLeft = RightToLeft.Yes;
            

            // قفل کردن RichTextBox برای جلوگیری از ویرایش
            richTextBox1.ReadOnly = true;

            // تنظیم فونت برای نمایش صحیح متن فارسی
            Font font = new Font("Vazir", 9);
            richTextBox1.Font = font;

            // تنظیم حاشیه داخلی برای فاصله دادن متن از لبه‌ها
            richTextBox1.Padding = new Padding(10);

            // قرار دادن متن مورد نظر
            richTextBox1.Text = @"

             2-2-1-	IAEA  (آژانس بین المللی انرژی اتمی): 
             آژانس پروتکل های کنترل کیفیت را برای رادیولوژی تشخیصی، از جمله اسکنرهای سی تی، با تمرکز بر دزیمتری و کیفیت تصویر 
             فراهم میکند. تست‌ها شامل حدود 10 آزمون هستند که شامل دقت و یکنواختی عدد CT، خطی بودن، ضخامت برش، وضوح 
             فضایی، تشخیص‌ پذیری با کنتراست کم، نویز و اندازه‌گیری دوز است


             2-2-2-	AAPM  (انجمن فیزیکدانان آمریکایی در پزشکی): 
             AAPM مجموعه ای جامع از تست های کنترل کیفی سی تی اسکن با بیش از 30 تست خاص را ارائه می دهد که جنبه های مختلف 
             عملکرد اسکنر سی تی را پوشش میدهد. این استاندارد جامع، تستهای مربوط به دقت، خطی بودن و یکنواختی عدد CT، 
            ضخامت و فاصله برش، وضوح فضایی، قابلیت تشخیص کنتراست پایین، نویز، مصنوعات تصویری و دزیمتری را پوشش می دهد
             همچنین شامل آزمایش‌هایی برای کاربردهای پیشرفته CT مانند پرفیوژن، تصویربرداری قلب و تصویربرداری طیفی است


            2-2-3-	استانداردهای خاص سازنده: 
             شرکت هایی مانند زیمنس، GE Healthcare،Philips  و Toshiba پروتکلهای کنترل کیفیت خود را دارند که برای سیستم های CT 
             خود طراحی شده اند و می تواند از 10 تا 20 آزمایش متفاوت باشد که جنبه های مختلف عملکرد اسکنر سی تی را بررسی می 
             کند. این تست ها اغلب به طور خاص برای تجهیزات سازنده طراحی می شوند و ممکن است شامل تست های اختصاصی باشند. این 
             استانداردها اغلب شامل تست هایی برای دقت عدد CT، یکنواختی، خطی بودن، ضخامت برش، وضوح فضایی، تشخیص پذیری 
            با کنتراست کم، نویز و دزیمتری می باشند. همچنین ممکن است شامل آزمایش‌هایی مخصوص فناوری‌های اختصاصی و 
             تکنیک‌های تصویربرداری توسعه‌یافته توسط سازنده باشند.


              2-2-4-	دفتر حفاظت در برابر تشعشعات سازمان انرژی اتمی ایران: 
             این سازمان استانداردهای ملی کنترل کیفی حفاظت پرتو و دزیمتری در تصویربرداری پزشکی از جمله CT را ایجاد کرده است و 
             شامل تست های دزیمتری، دقت و یکنواختی عدد CT، خطی بودن، ضخامت برش، تفکیک مکانی، تشخیص پذیری با کنتراست 
              کم، نویز و مصنوعات تصویری می باشد.


";


        }
    }
}
