using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace formss
{
    public partial class WeeklyAndDailyTestCriteriaForm : Form
    {
        public WeeklyAndDailyTestCriteriaForm()
        {
            InitializeComponent();
        }

        private void WeeklyAndDailyTestCriteriaForm_Load(object sender, EventArgs e)
        {
                // تنظیم متن به راست به چپ
    richTextBox1.RightToLeft = RightToLeft.Yes;
   

    // قفل کردن RichTextBox برای جلوگیری از ویرایش
    richTextBox1.ReadOnly = true;

    // تنظیم فونت برای نمایش صحیح متن فارسی
    richTextBox1.Font = new Font("Tahoma", 12);

    // قرار دادن متن مورد نظر
    richTextBox1.Text = @" 

  آزمون نویز :

 معیار پذیرش: 
معیار پذیرش دستگاه سی تی اسکن در این آزمون، نویز (SD) کمتر یا مساوی %20 مقدار نویز تعیین شده توسط شرکت سازنده و یا مقدار اندازه¬گیری شده آن در زمان انجام آزمون¬های پذیرش است، به شرط آنکه اختلاف مقدار عدد نویز با میانگین عدد سی تی اسکن تحت هیچ شرایطی بیشتر از 20 نباشد. 
معیار اصلاح: 
درصورتیکه عدد نویز بین %20 تا %30 با مقدار نویز تعیین شده توسط شرکت سازنده و یا مقدار اندازه¬گیری شده آن در زمان انجام آزمون¬های پذیرش باشد دستگاه نیاز به اصلاح و رفع عیب دارد. درهرصورت و تحت هیچ شرایطی اختلاف نویز با میانگین عدد سی تی اسکن نباید بیشتر از 35 عدد باشد. 
معیار تعلیق: 
درصورتیکه عدد نویز بیش از %30 با مقدار نویز تعیین شده توسط شرکت سازنده و یا مقدار اندازه¬گیری شده آن در زمان انجام آزمون¬های پذیرش باشد، استفاده از دستگاه سی تی اسکن مجاز نخواهد بود و مرکز بهره-برداری کننده از آن باید نسبت به رفع عیب دستگاه اقدام لازم را به عمل آورد.

 آزمون صحت عدد سیتی اسکن: 


معیار پذیرش: 
معیار پذیرش دستگاه سی تی اسکن در این آزمون، حداکثر خطای کمتر یا مساوی  5HU برای عدد سی تی اسکن اندازه¬گیری شده مواد موجود در فانتوم است. 
معیار اصلاح: 
درصورتیکه عدد سی تی اسکن اندازه¬گیری شده برای مواد موجود در فانتوم بین 5HU تا 15HU با مقادیر تعریف¬شده آن اختلاف داشته باشد، دستگاه نیاز به اصلاح و رفع عیب دارد. 
معیار تعلیق: 
درصورتیکه عدد سی تی اسکن اندازه¬گیری شده برای مواد موجود در فانتوم بیش از  15HU مقادیر تعریف-شده آن اختلاف داشته باشد، استفاده از دستگاه مجاز نخواهد بود و مرکز بهره¬برداری کننده از آن باید نسبت به رفع عیب دستگاه اقدام لازم را به عمل آورد.
  ";
        }
    }
}
